For get working Tiger Hash do 

 $ make

 $ erl
 Erlang (BEAM) emulator version 5.6.3 [source] [smp:2] [async-threads:0] [kernel-poll:false]

 Eshell V5.6.3  (abort with ^G)
 1> c(tiger).
 {ok,tiger}
 2> tiger:start().
 <0.37.0>
 3> tiger:hash("tiger").
 [108,96,140,225,50,117,176,127,25,118,131,26,197,250,159,85,139,9,82,161,227,249,201,211]
 4> tiger:stop().
 stop

hash() take string parameter and return Tiger Hash in 24-bytes string
